import { Container, Grid, styled, Box } from "@mui/material"
import ButtonBase from "@mui/material/ButtonBase"
import React, { Component, useState, useEffect, useRef, useCallback } from "react"
// import { useAuthContext } from "../../contexts/auth/consume"
// import { useQueryCarbonAcitivity, useQueryRank } from "../../adapter/query"
import { Text, Button, Select } from "../../components"
// import { COLORS } from "../../theme"
// import { CardItem } from "./View"
import Image from "next/image"
import DeviceDetector from "device-detector-js"
import { padding } from "@mui/system"

const InfoContainer = () => {
  const Comp1 = useRef(null)
  const Comp2 = useRef(null)

  useEffect(() => {
    const urlParams = new URLSearchParams(window.location.search)
    const scroll = urlParams.get("scroll")
    if (scroll == 2) {
      // window.scrollTo({
      //   top: 100,
      //   left: 0,
      //   behavior: "smooth",
      // })
      Comp2.current.scrollIntoView({
        behavior: "smooth",
      })
    }
  })

  return (
    <MainBox>
      <Wrapper ref={Comp1}>
        <Image src="/logo_info_1.png" alt="" width="100px" height="100px" />
        <Text type="24" fontWeight={700} textAlign="center" color="black">
          ฉลากลดคาร์บอนฟุตพริ้นท์ หรือ ฉลากลดโลกร้อน
        </Text>
        <Text type="12" color="black">
          &nbsp;&nbsp;&nbsp;เครื่องหมายลดคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ หรือ ฉลากลดโลกร้อน คือ
          ฉลากที่แสดงว่าผลิตภัณฑ์ได้ผ่านการประเมินคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์
          และสามารถลดการปล่อยก๊าซเรือนกระจกของผลิตภัณฑ์ได้ตามเกณฑ์ที่กำหนด
          ซึ่งเป็นการประเมินการปล่อยก๊าซเรือนกระจกตลอดวัฏจักรชีวิตของผลิตภัณฑ์ ตั้งแต่การได้มาซึ่งวัตถุดิบ การขนส่ง
          กระบวนการผลิต การใช้งาน และการจัดการซากผลิตภัณฑ์หลังใช้ โดยมีรูปแบบสำหรับการประเมินประกอบด้วย
          การประเมินคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ในปีปัจจุบัน การประเมินคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ในปีฐาน (Base Year)
          การเปรียบเทียบคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ในปีปัจจุบันกับปีฐาน
          และนำผลการเปรียบเทียบพิจารณาตามเกณฑ์การประเมินเพื่อขึ้นทะเบียนเครื่องหมายลดคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์
          เมื่อผ่านตามเกณฑ์ที่กำหนดสามารถติดเครื่องหมายลดคาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์ บนผลิตภัณฑ์
          หรือเผยแพร่บนสื่อต่างๆ
        </Text>
      </Wrapper>
      <Wrapper ref={Comp2}>
        <Image src="/logo_info_2.png" alt="" width="100px" height="100px" />
        <Text type="24" fontWeight={700} color="black">
          คาร์บอนฟุตพริ้นท์ของผลิตภัณฑ์
        </Text>
        <Text type="12" color="black">
          &nbsp;&nbsp;&nbsp;การปล่อยก๊าซเรือนกระจกจากกิจกรรมต่าง ๆ ของมนุษย์อย่างต่อเนื่อง ไม่ว่าจะเป็นจากการใช้พลังงาน
          การเกษตร การพัฒนาและขยายตัวของภาคอุตสาหกรรม การขนส่ง รวมถึงการตัดไม้ทำลายป่า
          และการทำลายสิ่งแวดล้อมในรูปแบบอื่น ๆ ล้วนเป็นสาเหตุสำคัญของการเกิดภาวะโลกร้อน ซึ่งได้ส่งผลกระทบ
          ต่อการดำรงชีพของมนุษย์ สิ่งมีชีวิต และสิ่งแวดล้อม ที่นับวันจะทวีความรุนแรงมากขึ้น ดังนั้น
          การลดการปล่อยก๊าซเรือนกระจกเพื่อลดภาวะโลกร้อน จึงเป็นหน้าที่ของผู้ที่เกี่ยวข้องทุกภาคส่วน
          ทั้งภาคอุตสาหกรรมและภาคเกษตรกรรมในฐานะผู้ผลิต ภาคบริการในฐานะผู้ขับเคลื่อนกิจกรรม
          รวมถึงภาคประชาชนในฐานะผู้บริโภค
          <br />
          &nbsp;&nbsp;&nbsp;การเลือกซื้อสินค้าหรือบริการที่มีการปล่อยก๊าซเรือนกระจกน้อย จึงเป็นทางหนึ่ง
          ที่ผู้บริโภคจะมีส่วนร่วมในการบริหารจัดการก๊าซเรือนกระจก และยังเป็นกลไกทางการตลาด
          ในการกระตุ้นให้ผู้ผลิตพัฒนาสินค้า ที่ลดการปล่อยก๊าซเรือนกระจกตามความต้องการของผู้บริโภคด้วย
          <br />
          &nbsp;&nbsp;&nbsp;อย่างไรก็ตาม ผู้บริโภคจำเป็นต้องมีข้อมูลในการตัดสินใจเลือกซื้อ
          องค์การบริหารจัดการก๊าซเรือนกระจก (องค์การมหาชน) หรือ อบก.
          ในฐานะหน่วยงานที่ทำหน้าที่ในการส่งเสริมและพัฒนาศักยภาพ
          ตลอดจนให้คำแนะนำแก่หน่วยงานภาครัฐและเอกชนในการบริหารจัดการก๊าซเรือนกระจก
          จึงได้พัฒนาโครงการส่งเสริมการใช้คาร์บอนฟุตพริ้นท์ (Carbon Footprint)
          ของผลิตภัณฑ์ขึ้นเพื่อส่งเสริมให้ผู้บริโภคมีข้อมูลการปล่อยก๊าซเรือนกระจกของผลิตภัณฑ์แต่ละชนิดประกอบการตัดสินใจ
          และเป็นการเพิ่มขีดความสามารถของอุตสาหกรรมไทยในการแข่งขันในตลาดโลก
          <br />
          &nbsp;&nbsp;&nbsp;"คาร์บอนฟุตพริ้นท์" หมายถึง ปริมาณก๊าซเรือนกระจกที่ปล่อยออกมาจากผลิตภัณฑ์แต่ละหน่วย
          ตลอดวัฎจักรชีวิตของผลิตภัณฑ์ ตั้งแต่การได้มาซึ่งวัตถุดิบ กระบวนการผลิต/การประกอบชิ้นงาน การกระจายสินค้า
          การใช้งาน และการจัดการของเสียหลังหมดอายุการใช้งาน รวมถึงการขนส่งที่เกี่ยวข้อง โดยคำนวณออกมาในรูปของ กรัม,
          กิโลกรัม หรือตันคาร์บอนไดออกไซด์เทียบเท่า
          <br />
          &nbsp;&nbsp;&nbsp;เครื่องหมายคาร์บอนฟุตพริ้นท์ ที่จะติดบนสินค้าหรือผลิตภัณฑ์ต่าง ๆ นั้น
          เป็นการแสดงข้อมูลให้ผู้บริโภคได้ทราบว่า
          ตลอดวัฏจักรชีวิตของผลิตภัณฑ์เหล่านั้นมีการปล่อยก๊าซเรือนกระจกออกมาปริมาณเท่าไหร่
          ตั้งแต่ขั้นตอนการได้มาซึ่งวัตถุดิบ กระบวนการผลิต การกระจายสินค้า การใช้งาน
          และการจัดการของเสียหลังหมดอายุการใช้งาน ซึ่งจะช่วยในการตัดสินใจชื้อของผู้บริโภค
          และกระตุ้นให้ผู้ประกอบการปรับเปลี่ยนเทคโนโลยีในการผลิตให้เป็นมิตรกับสิ่งแวดล้อมมากยิ่งขึ้น
          การใช้คาร์บอนฟุตพริ้นท์ยังช่วยเพิ่มขีดความสามารถในการแข่งขันในตลาดโลกด้วย
          เนื่องจากขณะนี้ในหลายประเทศเริ่มมีการนำคาร์บอนฟุตพริ้นท์มาใช้กันแล้ว ทั้งในอังกฤษ ฝรั่งเศส สวิสเซอร์แลนด์
          แคนาดา ญี่ปุ่น และเกาหลี เป็นต้น
          และมีการเรียกร้องให้สินค้าที่นำเข้าจากประเทศไทยต้องติดเครื่องหมายคาร์บอนฟุตพริ้นท์ด้วย นอกจากนั้น
          หากประเทศไทยมีการดำเนินโครงการและเก็บข้อมูลการลดการปล่อยก๊าซเรือนกระจกที่ชัดเจน
          จะช่วยให้เรามีอำนาจในการต่อรองมากขึ้นในการประชุมระดับโลกเพื่อกำหนดแนวทางแก้ไขปัญหาภาวะโลกร้อน
        </Text>
      </Wrapper>
    </MainBox>
  )
}

export default InfoContainer

const MainBox = styled(Box)({
  display: "flex",
  flexDirection: "column",
  gap: "40px",
  padding: "16px",
  alignItems: "center",
})

const Wrapper = styled(Box)({
  display: "flex",
  width: "100%",
  flexDirection: "column",
  gap: "16px",
  alignItems: "center",
})
